show ip protocols to show the current protocols
RIPv1 does not send subnet mask information with routing updates to VLSM is not supported. Updates are sent every 30 seconds as broadcast traffic. Does not support authentication.

RIPv2 supports VLSM, uses multicast address 224.0.0.9, and supports authentication. 
  R1(config)# router rip
  R1(config-router)# version 2
  R1(config-router)# network 10.0.0.0
  R1(config-router)# no auto-summary
RIP will automatically summarize routes to the classful boundary by default. For example, 1921168.10.1/30 will be advertised as 192.168.10.0/24 - class C address /24 by default, this is almost never desirable, use the no auto-summary command to disable this. 
  R1(config-router)# interface f1/0
  R1(config-router)# ip summary-address rip 10.0.0.0 255.255.0.0
These enable manual summarization to control exactly how you want to summarize. Individual summarized routes are not advertised, only their summarized routes. 
show ip rip database to show all RIP routes
  R1(config)# ip route 0.0.0.0 0.0.0.0 203.0.113.2
  R1(config)# router rip
  R1(config-router)# default-information originate
This is for default route injection to allow RIP to advertise a static route along its adjacencies. 

EIGRP is an advanced distance vector protocol with a fast convergence time. Supports large networks, and supports bounded updates where network topology change updates are only sent to routers affected by the change. Messages are sent via multicast. Automatically performs equal cost load balancing on up to 4 paths by default; can be increased to 32. Can also be configured to perform unequal cost load balancing. 
EIGRP must have the same AS (Autonomous System) number to peer with each other, meaning an independent administrative domain - this segments internal networks. 
EIGRP uses a wildcard mask, which is the inverse of a subnet mask. 
  R1(config-router)# network 10.0.0.0 0.0.255.255 - this network command means: look for interfaces with an IP address which falls within the 10.0.0.0/16 range - does NOT advertise anything on 10.0.0.0/8, or any address that does not begin with 10.0.x.x and also does not advertise itself. Only advertises the addresses on the interface. Enable EIGRP on those interfaces - send out and listen for EIGRP hello messages and peer with adjacent EIRGP routers. Advertise the network and mask which is configured on those interfaces. 
EIGRP routers identify themselves using an EIGRP Router ID which is in the form of an IP address. This will default to being the highest IP Address of any loopback interfaces configured on the router, or the highest other IP address if a loopback does not exist. Loopback addresses never go down, so the Router ID will not change. Can be manually specified. Best practice is to use a Loopback or manually set the Router ID. 
  R1(config-router)# router eigrp 100
  R1(config-router)# eigrp router-id 2.2.2.2

show run | section eigrp to verify EIGRP is being used
show eigrp interfaces shows the interfaces on the router
show eigrp neighbors shows adjacencies
